espressif/esp-idf/components/soc/esp32h2/register/soc/hp_apm_reg.h
/** HP_APM_REGION8_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION8_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x64)
/** HP_APM_REGION8_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region8
 */
#define HP_APM_REGION8_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_START_M  (HP_APM_REGION8_ADDR_START_V << HP_APM_REGION8_ADDR_START_S)
#define HP_APM_REGION8_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_START_S  0

/** HP_APM_REGION8_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION8_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x68)
/** HP_APM_REGION8_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region8
 */
#define HP_APM_REGION8_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_END_M  (HP_APM_REGION8_ADDR_END_V << HP_APM_REGION8_ADDR_END_S)
#define HP_APM_REGION8_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION8_ADDR_END_S  0

/** HP_APM_REGION8_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION8_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x6c)
/** HP_APM_REGION8_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION8_R0_PMS_X    (BIT(0))
#define HP_APM_REGION8_R0_PMS_X_M  (HP_APM_REGION8_R0_PMS_X_V << HP_APM_REGION8_R0_PMS_X_S)
#define HP_APM_REGION8_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION8_R0_PMS_X_S  0
/** HP_APM_REGION8_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION8_R0_PMS_W    (BIT(1))
#define HP_APM_REGION8_R0_PMS_W_M  (HP_APM_REGION8_R0_PMS_W_V << HP_APM_REGION8_R0_PMS_W_S)
#define HP_APM_REGION8_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION8_R0_PMS_W_S  1
/** HP_APM_REGION8_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION8_R0_PMS_R    (BIT(2))
#define HP_APM_REGION8_R0_PMS_R_M  (HP_APM_REGION8_R0_PMS_R_V << HP_APM_REGION8_R0_PMS_R_S)
#define HP_APM_REGION8_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION8_R0_PMS_R_S  2
/** HP_APM_REGION8_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION8_R1_PMS_X    (BIT(4))
#define HP_APM_REGION8_R1_PMS_X_M  (HP_APM_REGION8_R1_PMS_X_V << HP_APM_REGION8_R1_PMS_X_S)
#define HP_APM_REGION8_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION8_R1_PMS_X_S  4
/** HP_APM_REGION8_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION8_R1_PMS_W    (BIT(5))
#define HP_APM_REGION8_R1_PMS_W_M  (HP_APM_REGION8_R1_PMS_W_V << HP_APM_REGION8_R1_PMS_W_S)
#define HP_APM_REGION8_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION8_R1_PMS_W_S  5
/** HP_APM_REGION8_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION8_R1_PMS_R    (BIT(6))
#define HP_APM_REGION8_R1_PMS_R_M  (HP_APM_REGION8_R1_PMS_R_V << HP_APM_REGION8_R1_PMS_R_S)
#define HP_APM_REGION8_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION8_R1_PMS_R_S  6
/** HP_APM_REGION8_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION8_R2_PMS_X    (BIT(8))
#define HP_APM_REGION8_R2_PMS_X_M  (HP_APM_REGION8_R2_PMS_X_V << HP_APM_REGION8_R2_PMS_X_S)
#define HP_APM_REGION8_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION8_R2_PMS_X_S  8
/** HP_APM_REGION8_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION8_R2_PMS_W    (BIT(9))
#define HP_APM_REGION8_R2_PMS_W_M  (HP_APM_REGION8_R2_PMS_W_V << HP_APM_REGION8_R2_PMS_W_S)
#define HP_APM_REGION8_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION8_R2_PMS_W_S  9
/** HP_APM_REGION8_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION8_R2_PMS_R    (BIT(10))
#define HP_APM_REGION8_R2_PMS_R_M  (HP_APM_REGION8_R2_PMS_R_V << HP_APM_REGION8_R2_PMS_R_S)
#define HP_APM_REGION8_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION8_R2_PMS_R_S  10

/** HP_APM_REGION9_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION9_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x70)
/** HP_APM_REGION9_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region9
 */
#define HP_APM_REGION9_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_START_M  (HP_APM_REGION9_ADDR_START_V << HP_APM_REGION9_ADDR_START_S)
#define HP_APM_REGION9_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_START_S  0

/** HP_APM_REGION9_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION9_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x74)
/** HP_APM_REGION9_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region9
 */
#define HP_APM_REGION9_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_END_M  (HP_APM_REGION9_ADDR_END_V << HP_APM_REGION9_ADDR_END_S)
#define HP_APM_REGION9_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION9_ADDR_END_S  0

/** HP_APM_REGION9_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION9_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x78)
/** HP_APM_REGION9_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION9_R0_PMS_X    (BIT(0))
#define HP_APM_REGION9_R0_PMS_X_M  (HP_APM_REGION9_R0_PMS_X_V << HP_APM_REGION9_R0_PMS_X_S)
#define HP_APM_REGION9_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION9_R0_PMS_X_S  0
/** HP_APM_REGION9_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION9_R0_PMS_W    (BIT(1))
#define HP_APM_REGION9_R0_PMS_W_M  (HP_APM_REGION9_R0_PMS_W_V << HP_APM_REGION9_R0_PMS_W_S)
#define HP_APM_REGION9_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION9_R0_PMS_W_S  1
/** HP_APM_REGION9_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION9_R0_PMS_R    (BIT(2))
#define HP_APM_REGION9_R0_PMS_R_M  (HP_APM_REGION9_R0_PMS_R_V << HP_APM_REGION9_R0_PMS_R_S)
#define HP_APM_REGION9_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION9_R0_PMS_R_S  2
/** HP_APM_REGION9_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION9_R1_PMS_X    (BIT(4))
#define HP_APM_REGION9_R1_PMS_X_M  (HP_APM_REGION9_R1_PMS_X_V << HP_APM_REGION9_R1_PMS_X_S)
#define HP_APM_REGION9_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION9_R1_PMS_X_S  4
/** HP_APM_REGION9_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION9_R1_PMS_W    (BIT(5))
#define HP_APM_REGION9_R1_PMS_W_M  (HP_APM_REGION9_R1_PMS_W_V << HP_APM_REGION9_R1_PMS_W_S)
#define HP_APM_REGION9_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION9_R1_PMS_W_S  5
/** HP_APM_REGION9_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION9_R1_PMS_R    (BIT(6))
#define HP_APM_REGION9_R1_PMS_R_M  (HP_APM_REGION9_R1_PMS_R_V << HP_APM_REGION9_R1_PMS_R_S)
#define HP_APM_REGION9_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION9_R1_PMS_R_S  6
/** HP_APM_REGION9_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION9_R2_PMS_X    (BIT(8))
#define HP_APM_REGION9_R2_PMS_X_M  (HP_APM_REGION9_R2_PMS_X_V << HP_APM_REGION9_R2_PMS_X_S)
#define HP_APM_REGION9_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION9_R2_PMS_X_S  8
/** HP_APM_REGION9_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION9_R2_PMS_W    (BIT(9))
#define HP_APM_REGION9_R2_PMS_W_M  (HP_APM_REGION9_R2_PMS_W_V << HP_APM_REGION9_R2_PMS_W_S)
#define HP_APM_REGION9_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION9_R2_PMS_W_S  9
/** HP_APM_REGION9_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION9_R2_PMS_R    (BIT(10))
#define HP_APM_REGION9_R2_PMS_R_M  (HP_APM_REGION9_R2_PMS_R_V << HP_APM_REGION9_R2_PMS_R_S)
#define HP_APM_REGION9_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION9_R2_PMS_R_S  10

/** HP_APM_REGION10_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION10_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x7c)
/** HP_APM_REGION10_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region10
 */
#define HP_APM_REGION10_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_START_M  (HP_APM_REGION10_ADDR_START_V << HP_APM_REGION10_ADDR_START_S)
#define HP_APM_REGION10_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_START_S  0

/** HP_APM_REGION10_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION10_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x80)
/** HP_APM_REGION10_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region10
 */
#define HP_APM_REGION10_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_END_M  (HP_APM_REGION10_ADDR_END_V << HP_APM_REGION10_ADDR_END_S)
#define HP_APM_REGION10_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION10_ADDR_END_S  0

/** HP_APM_REGION10_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION10_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x84)
/** HP_APM_REGION10_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION10_R0_PMS_X    (BIT(0))
#define HP_APM_REGION10_R0_PMS_X_M  (HP_APM_REGION10_R0_PMS_X_V << HP_APM_REGION10_R0_PMS_X_S)
#define HP_APM_REGION10_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION10_R0_PMS_X_S  0
/** HP_APM_REGION10_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION10_R0_PMS_W    (BIT(1))
#define HP_APM_REGION10_R0_PMS_W_M  (HP_APM_REGION10_R0_PMS_W_V << HP_APM_REGION10_R0_PMS_W_S)
#define HP_APM_REGION10_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION10_R0_PMS_W_S  1
/** HP_APM_REGION10_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION10_R0_PMS_R    (BIT(2))
#define HP_APM_REGION10_R0_PMS_R_M  (HP_APM_REGION10_R0_PMS_R_V << HP_APM_REGION10_R0_PMS_R_S)
#define HP_APM_REGION10_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION10_R0_PMS_R_S  2
/** HP_APM_REGION10_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION10_R1_PMS_X    (BIT(4))
#define HP_APM_REGION10_R1_PMS_X_M  (HP_APM_REGION10_R1_PMS_X_V << HP_APM_REGION10_R1_PMS_X_S)
#define HP_APM_REGION10_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION10_R1_PMS_X_S  4
/** HP_APM_REGION10_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION10_R1_PMS_W    (BIT(5))
#define HP_APM_REGION10_R1_PMS_W_M  (HP_APM_REGION10_R1_PMS_W_V << HP_APM_REGION10_R1_PMS_W_S)
#define HP_APM_REGION10_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION10_R1_PMS_W_S  5
/** HP_APM_REGION10_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION10_R1_PMS_R    (BIT(6))
#define HP_APM_REGION10_R1_PMS_R_M  (HP_APM_REGION10_R1_PMS_R_V << HP_APM_REGION10_R1_PMS_R_S)
#define HP_APM_REGION10_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION10_R1_PMS_R_S  6
/** HP_APM_REGION10_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION10_R2_PMS_X    (BIT(8))
#define HP_APM_REGION10_R2_PMS_X_M  (HP_APM_REGION10_R2_PMS_X_V << HP_APM_REGION10_R2_PMS_X_S)
#define HP_APM_REGION10_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION10_R2_PMS_X_S  8
/** HP_APM_REGION10_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION10_R2_PMS_W    (BIT(9))
#define HP_APM_REGION10_R2_PMS_W_M  (HP_APM_REGION10_R2_PMS_W_V << HP_APM_REGION10_R2_PMS_W_S)
#define HP_APM_REGION10_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION10_R2_PMS_W_S  9
/** HP_APM_REGION10_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION10_R2_PMS_R    (BIT(10))
#define HP_APM_REGION10_R2_PMS_R_M  (HP_APM_REGION10_R2_PMS_R_V << HP_APM_REGION10_R2_PMS_R_S)
#define HP_APM_REGION10_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION10_R2_PMS_R_S  10

/** HP_APM_REGION11_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION11_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x88)
/** HP_APM_REGION11_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region11
 */
#define HP_APM_REGION11_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_START_M  (HP_APM_REGION11_ADDR_START_V << HP_APM_REGION11_ADDR_START_S)
#define HP_APM_REGION11_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_START_S  0

/** HP_APM_REGION11_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION11_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x8c)
/** HP_APM_REGION11_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region11
 */
#define HP_APM_REGION11_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_END_M  (HP_APM_REGION11_ADDR_END_V << HP_APM_REGION11_ADDR_END_S)
#define HP_APM_REGION11_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION11_ADDR_END_S  0

/** HP_APM_REGION11_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION11_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x90)
/** HP_APM_REGION11_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION11_R0_PMS_X    (BIT(0))
#define HP_APM_REGION11_R0_PMS_X_M  (HP_APM_REGION11_R0_PMS_X_V << HP_APM_REGION11_R0_PMS_X_S)
#define HP_APM_REGION11_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION11_R0_PMS_X_S  0
/** HP_APM_REGION11_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION11_R0_PMS_W    (BIT(1))
#define HP_APM_REGION11_R0_PMS_W_M  (HP_APM_REGION11_R0_PMS_W_V << HP_APM_REGION11_R0_PMS_W_S)
#define HP_APM_REGION11_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION11_R0_PMS_W_S  1
/** HP_APM_REGION11_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION11_R0_PMS_R    (BIT(2))
#define HP_APM_REGION11_R0_PMS_R_M  (HP_APM_REGION11_R0_PMS_R_V << HP_APM_REGION11_R0_PMS_R_S)
#define HP_APM_REGION11_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION11_R0_PMS_R_S  2
/** HP_APM_REGION11_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION11_R1_PMS_X    (BIT(4))
#define HP_APM_REGION11_R1_PMS_X_M  (HP_APM_REGION11_R1_PMS_X_V << HP_APM_REGION11_R1_PMS_X_S)
#define HP_APM_REGION11_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION11_R1_PMS_X_S  4
/** HP_APM_REGION11_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION11_R1_PMS_W    (BIT(5))
#define HP_APM_REGION11_R1_PMS_W_M  (HP_APM_REGION11_R1_PMS_W_V << HP_APM_REGION11_R1_PMS_W_S)
#define HP_APM_REGION11_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION11_R1_PMS_W_S  5
/** HP_APM_REGION11_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION11_R1_PMS_R    (BIT(6))
#define HP_APM_REGION11_R1_PMS_R_M  (HP_APM_REGION11_R1_PMS_R_V << HP_APM_REGION11_R1_PMS_R_S)
#define HP_APM_REGION11_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION11_R1_PMS_R_S  6
/** HP_APM_REGION11_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION11_R2_PMS_X    (BIT(8))
#define HP_APM_REGION11_R2_PMS_X_M  (HP_APM_REGION11_R2_PMS_X_V << HP_APM_REGION11_R2_PMS_X_S)
#define HP_APM_REGION11_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION11_R2_PMS_X_S  8
/** HP_APM_REGION11_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION11_R2_PMS_W    (BIT(9))
#define HP_APM_REGION11_R2_PMS_W_M  (HP_APM_REGION11_R2_PMS_W_V << HP_APM_REGION11_R2_PMS_W_S)
#define HP_APM_REGION11_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION11_R2_PMS_W_S  9
/** HP_APM_REGION11_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION11_R2_PMS_R    (BIT(10))
#define HP_APM_REGION11_R2_PMS_R_M  (HP_APM_REGION11_R2_PMS_R_V << HP_APM_REGION11_R2_PMS_R_S)
#define HP_APM_REGION11_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION11_R2_PMS_R_S  10

