espressif/esp-idf/components/soc/esp32h2/register/soc/hp_apm_reg.h
/** HP_APM_REGION12_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION12_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x94)
/** HP_APM_REGION12_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region12
 */
#define HP_APM_REGION12_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_START_M  (HP_APM_REGION12_ADDR_START_V << HP_APM_REGION12_ADDR_START_S)
#define HP_APM_REGION12_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_START_S  0

/** HP_APM_REGION12_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION12_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x98)
/** HP_APM_REGION12_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region12
 */
#define HP_APM_REGION12_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_END_M  (HP_APM_REGION12_ADDR_END_V << HP_APM_REGION12_ADDR_END_S)
#define HP_APM_REGION12_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION12_ADDR_END_S  0

/** HP_APM_REGION12_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION12_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x9c)
/** HP_APM_REGION12_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION12_R0_PMS_X    (BIT(0))
#define HP_APM_REGION12_R0_PMS_X_M  (HP_APM_REGION12_R0_PMS_X_V << HP_APM_REGION12_R0_PMS_X_S)
#define HP_APM_REGION12_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION12_R0_PMS_X_S  0
/** HP_APM_REGION12_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION12_R0_PMS_W    (BIT(1))
#define HP_APM_REGION12_R0_PMS_W_M  (HP_APM_REGION12_R0_PMS_W_V << HP_APM_REGION12_R0_PMS_W_S)
#define HP_APM_REGION12_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION12_R0_PMS_W_S  1
/** HP_APM_REGION12_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION12_R0_PMS_R    (BIT(2))
#define HP_APM_REGION12_R0_PMS_R_M  (HP_APM_REGION12_R0_PMS_R_V << HP_APM_REGION12_R0_PMS_R_S)
#define HP_APM_REGION12_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION12_R0_PMS_R_S  2
/** HP_APM_REGION12_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION12_R1_PMS_X    (BIT(4))
#define HP_APM_REGION12_R1_PMS_X_M  (HP_APM_REGION12_R1_PMS_X_V << HP_APM_REGION12_R1_PMS_X_S)
#define HP_APM_REGION12_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION12_R1_PMS_X_S  4
/** HP_APM_REGION12_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION12_R1_PMS_W    (BIT(5))
#define HP_APM_REGION12_R1_PMS_W_M  (HP_APM_REGION12_R1_PMS_W_V << HP_APM_REGION12_R1_PMS_W_S)
#define HP_APM_REGION12_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION12_R1_PMS_W_S  5
/** HP_APM_REGION12_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION12_R1_PMS_R    (BIT(6))
#define HP_APM_REGION12_R1_PMS_R_M  (HP_APM_REGION12_R1_PMS_R_V << HP_APM_REGION12_R1_PMS_R_S)
#define HP_APM_REGION12_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION12_R1_PMS_R_S  6
/** HP_APM_REGION12_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION12_R2_PMS_X    (BIT(8))
#define HP_APM_REGION12_R2_PMS_X_M  (HP_APM_REGION12_R2_PMS_X_V << HP_APM_REGION12_R2_PMS_X_S)
#define HP_APM_REGION12_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION12_R2_PMS_X_S  8
/** HP_APM_REGION12_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION12_R2_PMS_W    (BIT(9))
#define HP_APM_REGION12_R2_PMS_W_M  (HP_APM_REGION12_R2_PMS_W_V << HP_APM_REGION12_R2_PMS_W_S)
#define HP_APM_REGION12_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION12_R2_PMS_W_S  9
/** HP_APM_REGION12_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION12_R2_PMS_R    (BIT(10))
#define HP_APM_REGION12_R2_PMS_R_M  (HP_APM_REGION12_R2_PMS_R_V << HP_APM_REGION12_R2_PMS_R_S)
#define HP_APM_REGION12_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION12_R2_PMS_R_S  10

/** HP_APM_REGION13_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION13_ADDR_START_REG (DR_REG_HP_APM_BASE + 0xa0)
/** HP_APM_REGION13_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region13
 */
#define HP_APM_REGION13_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_START_M  (HP_APM_REGION13_ADDR_START_V << HP_APM_REGION13_ADDR_START_S)
#define HP_APM_REGION13_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_START_S  0

/** HP_APM_REGION13_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION13_ADDR_END_REG (DR_REG_HP_APM_BASE + 0xa4)
/** HP_APM_REGION13_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region13
 */
#define HP_APM_REGION13_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_END_M  (HP_APM_REGION13_ADDR_END_V << HP_APM_REGION13_ADDR_END_S)
#define HP_APM_REGION13_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION13_ADDR_END_S  0

/** HP_APM_REGION13_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION13_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0xa8)
/** HP_APM_REGION13_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION13_R0_PMS_X    (BIT(0))
#define HP_APM_REGION13_R0_PMS_X_M  (HP_APM_REGION13_R0_PMS_X_V << HP_APM_REGION13_R0_PMS_X_S)
#define HP_APM_REGION13_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION13_R0_PMS_X_S  0
/** HP_APM_REGION13_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION13_R0_PMS_W    (BIT(1))
#define HP_APM_REGION13_R0_PMS_W_M  (HP_APM_REGION13_R0_PMS_W_V << HP_APM_REGION13_R0_PMS_W_S)
#define HP_APM_REGION13_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION13_R0_PMS_W_S  1
/** HP_APM_REGION13_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION13_R0_PMS_R    (BIT(2))
#define HP_APM_REGION13_R0_PMS_R_M  (HP_APM_REGION13_R0_PMS_R_V << HP_APM_REGION13_R0_PMS_R_S)
#define HP_APM_REGION13_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION13_R0_PMS_R_S  2
/** HP_APM_REGION13_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION13_R1_PMS_X    (BIT(4))
#define HP_APM_REGION13_R1_PMS_X_M  (HP_APM_REGION13_R1_PMS_X_V << HP_APM_REGION13_R1_PMS_X_S)
#define HP_APM_REGION13_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION13_R1_PMS_X_S  4
/** HP_APM_REGION13_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION13_R1_PMS_W    (BIT(5))
#define HP_APM_REGION13_R1_PMS_W_M  (HP_APM_REGION13_R1_PMS_W_V << HP_APM_REGION13_R1_PMS_W_S)
#define HP_APM_REGION13_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION13_R1_PMS_W_S  5
/** HP_APM_REGION13_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION13_R1_PMS_R    (BIT(6))
#define HP_APM_REGION13_R1_PMS_R_M  (HP_APM_REGION13_R1_PMS_R_V << HP_APM_REGION13_R1_PMS_R_S)
#define HP_APM_REGION13_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION13_R1_PMS_R_S  6
/** HP_APM_REGION13_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION13_R2_PMS_X    (BIT(8))
#define HP_APM_REGION13_R2_PMS_X_M  (HP_APM_REGION13_R2_PMS_X_V << HP_APM_REGION13_R2_PMS_X_S)
#define HP_APM_REGION13_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION13_R2_PMS_X_S  8
/** HP_APM_REGION13_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION13_R2_PMS_W    (BIT(9))
#define HP_APM_REGION13_R2_PMS_W_M  (HP_APM_REGION13_R2_PMS_W_V << HP_APM_REGION13_R2_PMS_W_S)
#define HP_APM_REGION13_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION13_R2_PMS_W_S  9
/** HP_APM_REGION13_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION13_R2_PMS_R    (BIT(10))
#define HP_APM_REGION13_R2_PMS_R_M  (HP_APM_REGION13_R2_PMS_R_V << HP_APM_REGION13_R2_PMS_R_S)
#define HP_APM_REGION13_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION13_R2_PMS_R_S  10

/** HP_APM_REGION14_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION14_ADDR_START_REG (DR_REG_HP_APM_BASE + 0xac)
/** HP_APM_REGION14_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region14
 */
#define HP_APM_REGION14_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_START_M  (HP_APM_REGION14_ADDR_START_V << HP_APM_REGION14_ADDR_START_S)
#define HP_APM_REGION14_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_START_S  0

/** HP_APM_REGION14_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION14_ADDR_END_REG (DR_REG_HP_APM_BASE + 0xb0)
/** HP_APM_REGION14_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region14
 */
#define HP_APM_REGION14_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_END_M  (HP_APM_REGION14_ADDR_END_V << HP_APM_REGION14_ADDR_END_S)
#define HP_APM_REGION14_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION14_ADDR_END_S  0

/** HP_APM_REGION14_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION14_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0xb4)
/** HP_APM_REGION14_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION14_R0_PMS_X    (BIT(0))
#define HP_APM_REGION14_R0_PMS_X_M  (HP_APM_REGION14_R0_PMS_X_V << HP_APM_REGION14_R0_PMS_X_S)
#define HP_APM_REGION14_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION14_R0_PMS_X_S  0
/** HP_APM_REGION14_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION14_R0_PMS_W    (BIT(1))
#define HP_APM_REGION14_R0_PMS_W_M  (HP_APM_REGION14_R0_PMS_W_V << HP_APM_REGION14_R0_PMS_W_S)
#define HP_APM_REGION14_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION14_R0_PMS_W_S  1
/** HP_APM_REGION14_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION14_R0_PMS_R    (BIT(2))
#define HP_APM_REGION14_R0_PMS_R_M  (HP_APM_REGION14_R0_PMS_R_V << HP_APM_REGION14_R0_PMS_R_S)
#define HP_APM_REGION14_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION14_R0_PMS_R_S  2
/** HP_APM_REGION14_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION14_R1_PMS_X    (BIT(4))
#define HP_APM_REGION14_R1_PMS_X_M  (HP_APM_REGION14_R1_PMS_X_V << HP_APM_REGION14_R1_PMS_X_S)
#define HP_APM_REGION14_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION14_R1_PMS_X_S  4
/** HP_APM_REGION14_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION14_R1_PMS_W    (BIT(5))
#define HP_APM_REGION14_R1_PMS_W_M  (HP_APM_REGION14_R1_PMS_W_V << HP_APM_REGION14_R1_PMS_W_S)
#define HP_APM_REGION14_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION14_R1_PMS_W_S  5
/** HP_APM_REGION14_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION14_R1_PMS_R    (BIT(6))
#define HP_APM_REGION14_R1_PMS_R_M  (HP_APM_REGION14_R1_PMS_R_V << HP_APM_REGION14_R1_PMS_R_S)
#define HP_APM_REGION14_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION14_R1_PMS_R_S  6
/** HP_APM_REGION14_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION14_R2_PMS_X    (BIT(8))
#define HP_APM_REGION14_R2_PMS_X_M  (HP_APM_REGION14_R2_PMS_X_V << HP_APM_REGION14_R2_PMS_X_S)
#define HP_APM_REGION14_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION14_R2_PMS_X_S  8
/** HP_APM_REGION14_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION14_R2_PMS_W    (BIT(9))
#define HP_APM_REGION14_R2_PMS_W_M  (HP_APM_REGION14_R2_PMS_W_V << HP_APM_REGION14_R2_PMS_W_S)
#define HP_APM_REGION14_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION14_R2_PMS_W_S  9
/** HP_APM_REGION14_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION14_R2_PMS_R    (BIT(10))
#define HP_APM_REGION14_R2_PMS_R_M  (HP_APM_REGION14_R2_PMS_R_V << HP_APM_REGION14_R2_PMS_R_S)
#define HP_APM_REGION14_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION14_R2_PMS_R_S  10

